Revit 2027 API
Stone Class
 A static class that provides access to the property names that appear in the Stone visual asset schema.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Stone
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class Stone
Public NotInheritable Class Stone
public ref class Stone abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Stone = class end
The Stone type exposes the following members.
Properties
Name | Description
CommonTintColor |  The property labeled "Tint Color" from the "Stone" schema.
CommonTintToggle |  The property labeled "Tint" from the "Stone" schema.
StoneApplication |  The property labeled "Finish" from the "Stone" schema.
StoneBump |  The property labeled "Type" from the "Stone" schema.
StoneBumpAmount |  The property labeled "Amount" from the "Stone" schema.
StoneBumpMap |  The property labeled "Image" from the "Stone" schema.
StoneColor |  The property labeled "Image" from the "Stone" schema.
StonePattern |  The property labeled "Relief Pattern" from the "Stone" schema.
StonePatternAmount |  The property labeled "Amount" from the "Stone" schema.
StonePatternMap |  The property labeled "Image" from the "Stone" schema.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace